e76nystrom/monitor/src/stm32Info.cpp
 printf("\nopspeedr ");
 val = gpioPtr->OSPEEDR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> (2 * i)) & 0x3);

 printf("\npupdr    ");
 val = gpioPtr->PUPDR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> (2 * i)) & 0x3);
#endif	/* STM32F3 */

#if defined(STM32F1)
 printf("\n");
 printf("mode     ");
 val = gpioPtr->CRL;
 for (i = 0; i < 8; i++)
  printf(" %2d", (int) (val >> (4 * i)) & 0x3);

 val = gpioPtr->CRH;
 for (i = 0; i < 8; i++)
  printf(" %2d", (int) (val >> (4 * i)) & 0x3);

 printf("\n");
 printf("cnf      ");
 val = gpioPtr->CRL;
 for (i = 0; i < 8; i++)
  printf(" %2d", (int) (val >> ((4 * i) + 2)) & 0x3);

 val = gpioPtr->CRH;
 for (i = 0; i < 8; i++)
  printf(" %2d", (int) (val >> ((4 * i) + 2)) & 0x3);
#endif	/* STM32F1 */

 printf("\nidr      ");
 val = gpioPtr->IDR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> i) & 0x1);

 printf("\nodr      ");
 val = gpioPtr->ODR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> i) & 0x1);

 printf("\nbsrr     ");
 val = gpioPtr->BSRR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> i) & 0x1);

 printf("\nlckr     ");
 val = gpioPtr->LCKR;
 for (i = 0; i < 16; i++)
  printf(" %2lu", (val >> i) & 0x1);

#if defined(STM32F3) || defined(STM32F4) || defined(STM32H7)
 printf("\nafr      ");
 val = gpioPtr->AFR[0];
 for (i = 0; i < 8; i++)
  printf(" %2lu", (val >> (4 * i)) & 0xf);
 val = gpioPtr->AFR[1];
 for (i = 0; i < 8; i++)
  printf(" %2lu", (val >> (4 * i)) & 0xf);
#endif	/* STM32F3 */
 printf("\n");
 flushBuf();
}

#if 0
void gpioInfo(GPIO_TypeDef *gpio)
{
 printf("gpio %x %c\n",(unsigned int) gpio, portName(gpio));
#if defined(STM32F4)
 printf("MODER   %8lx ",gpio->MODER);
 printf("OTYPER  %8lx\n",gpio->OTYPER);
 printf("OSPEEDR %8lx ",gpio->OSPEEDR);
 printf("PUPDR   %8lx\n",gpio->PUPDR);
 printf("IDR     %8lx ",gpio->IDR);
 printf("ODR     %8lx\n",gpio->ODR);
 printf("BSRR    %8lx ",gpio->BSRR);
 printf("LCKR    %8lx\n",gpio->LCKR);
 printf("AFR[0]  %8lx ",gpio->AFR[0]);
 printf("AFR[1]  %8lx\n",gpio->AFR[1]);
 int i;
 printf("         ");
 for (i = 0; i < 16; i++)
  printf(" %2d", i);

 printf("\nmoder    ");
 int val = gpio->MODER;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> (2 * i)) & 0x3);

 printf("\notyper   ");
 val = gpio->OTYPER;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\nopspeedr ");
 val = gpio->OSPEEDR;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> (2 * i)) & 0x3);

 printf("\npupdr    ");
 val = gpio->PUPDR;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> (2 * i)) & 0x3);

 printf("\nidr      ");
 val = gpio->IDR;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\nodr      ");
 val = gpio->ODR;
 for (i = 0; i < 16; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\nafr      ");
 val = gpio->AFR[0];
 for (i = 0; i < 8; i++)
  printf(" %2d", (val >> (4 * i)) & 0xf);
 val = gpio->AFR[1];
 for (i = 0; i < 8; i++)
  printf(" %2d", (val >> (4 * i)) & 0xf);
#endif
 printf("\n");
 flushBuf();
}
#endif	/* 0 */

typedef struct
{
 TIM_TypeDef *tmr;
 char num;
} T_TIM, *P_TIM;

T_TIM tim[] =
{
 {TIM1,  1},
 {TIM2,  2},
 {TIM3,  3},
 {TIM4,  4},
#ifdef TIM5
 {TIM5,  5},
#endif
#ifdef TIM6
 {TIM6,  6},
#endif
#ifdef TIM7
 {TIM7,  7},
#endif
#ifdef TIM8
 {TIM8,  8},
#endif
#ifdef TIM9
 {TIM9,  9},
#endif
#ifdef TIM10
 {TIM10, 10},
#endif
#ifdef TIM11
 {TIM11, 11},
#endif
#ifdef TIM12
 {TIM12, 12},
#endif
#ifdef TIM13
 {TIM13, 13},
#endif
#ifdef TIM14
 {TIM14, 14},
#endif
#ifdef TIM15
 {TIM15, 15},
#endif
#ifdef TIM16
 {TIM16, 16},
#endif
#ifdef TIM17
 {TIM17, 17},
#endif
};

char timNum(TIM_TypeDef *tmr);

char timNum(TIM_TypeDef *tmr)
{
 for (auto & j : tim)
 {
  if (tmr == j.tmr)
  {
   return(j.num);
  }
 }
 return(0);
}

void tmrInfo(TIM_TypeDef *tmr)
{
 printf("tmr %x TIM%d\n", (unsigned int) tmr, timNum(tmr));
 printf("CR1   %8lx ", tmr->CR1);
 printf("CR2   %8lx\n",tmr->CR2);
 printf("SMCR  %8lx ",tmr->SMCR);
 printf("DIER  %8lx\n",tmr->DIER);
 printf("SR    %8lx ",tmr->SR);
 printf("EGR   %8lx\n",tmr->EGR);
 printf("CCMR1 %8lx ",tmr->CCMR1);
 printf("CCMR2 %8lx\n",tmr->CCMR2);
 printf("CCER  %8lx ",tmr->CCER);
 printf("CNT   %8lx\n",tmr->CNT);
 printf("PSC   %8lx ",tmr->PSC);
 printf("ARR   %8lx\n",tmr->ARR);
 printf("RCR   %8lx ",tmr->RCR);
 printf("CCR1  %8lx\n",tmr->CCR1);
 printf("CCR2  %8lx ",tmr->CCR2);
 printf("CCR3  %8lx\n",tmr->CCR3);
 printf("CCR4  %8lx ",tmr->CCR4);
 printf("BDTR  %8lx\n",tmr->BDTR);
 printf("DCR   %8lx ",tmr->DCR);
#if defined(__STM32F4xx_HAL_H) || defined(__STM32F7xx_HAL_H)
 printf("OR    %8lx\n",tmr->OR);
#endif
#if defined(STM32F1) ||  defined(STM32H7)
 newline();
#endif
 flushBuf();
}

void tmrInfo(TIM_TypeDef *tmr, int tmrFlag)
{
 int n = 0;
 printf("tmr %x TIM%d\n", (unsigned int) tmr, timNum(tmr));
 if (T_CHECK(tmrFlag, CR1)) {
  T_PRT(tmr, CR1);
  T_NL()}
 if (T_CHECK(tmrFlag, CR2)) {
  T_PRT(tmr, CR2);
  T_NL()}
 if (T_CHECK(tmrFlag, SMCR)) {
  T_PRT(tmr, SMCR);
  T_NL()}
 if (T_CHECK(tmrFlag, DIER)) {
  T_PRT(tmr, DIER);
  T_NL()}
 if (T_CHECK(tmrFlag, SR)) {
  T_PRT(tmr, SR);
  T_NL()}
 if (T_CHECK(tmrFlag, EGR)) {
  T_PRT(tmr, EGR);
  T_NL()}
 if (T_CHECK(tmrFlag, CCMR1)) {
  T_PRT(tmr, CCMR1);
  T_NL()}
 if (T_CHECK(tmrFlag, CCMR2)) {
  T_PRT(tmr, CCMR2);
  T_NL()}
 if (T_CHECK(tmrFlag, CCER)) {
  T_PRT(tmr, CCER);
  T_NL()}
 if (T_CHECK(tmrFlag, CNT)) {
  T_PRT(tmr, CNT);
  T_NL()}
 if (T_CHECK(tmrFlag, PSC)) {
  T_PRT(tmr, PSC);
  T_NL()}
 if (T_CHECK(tmrFlag, ARR)) {
  T_PRT(tmr, ARR);
  T_NL()}
 if (T_CHECK(tmrFlag, RCR)) {
  T_PRT(tmr, RCR);
  T_NL()}
 if (T_CHECK(tmrFlag, CCR1)) {
  T_PRT(tmr, CCR1);
  T_NL()}
 if (T_CHECK(tmrFlag, CCR2)) {
  T_PRT(tmr, CCR2);
  T_NL()}
 if (T_CHECK(tmrFlag, CCR3)) {
  T_PRT(tmr, CCR3);
  T_NL()}
 if (T_CHECK(tmrFlag, CCR4)) {
  T_PRT(tmr, CCR4);
  T_NL()}
 if (T_CHECK(tmrFlag, BDTR)) {
  T_PRT(tmr, BDTR);
  T_NL()}
 if (T_CHECK(tmrFlag, DCR)) {
  T_PRT(tmr, DCR);
  T_NL()}
 printf("\n");
 flushBuf();
}

 void extiBit(const char *label, uint32_t val)
 {
 printf("\n%6s", label);
 for (int i = 0; i <= 22; i++)
  printf(" %2d", (int) ((val >> i) & 0x1));
}

void extiInfo()
{
 printf("EXTI %x\n", (unsigned int) EXTI);
 int i;
 printf("      ");
 for (i = 0; i <= 22; i++)
  printf(" %2d", i);

 printf("\n");
 printf("IMR   ");
 int val = EXTI->IMR;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

