e76nystrom/monitor/src/stm32Info.cpp
#if defined(STM32F4)
 printf("\n");
 printf("EMR   ");
 val = EXTI->EMR;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\n");
 printf("RTSR  ");
 val = EXTI->RTSR;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\n");
 printf("FTSR  ");
 val = EXTI->FTSR;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);
 #endif	 /* STM32F4 */

 printf("\n");
 printf("SWIER ");
 val = EXTI->SWIER;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

 printf("\n");
 printf("PR    ");
 val = EXTI->PR;
 for (i = 0; i <= 22; i++)
  printf(" %2d", (val >> i) & 0x1);

#if defined(__STM32F4xx_HAL_H) || defined(__STM32F7xx_HAL_H)
 printf("\nSYSCFG %x\n", (unsigned int) SYSCFG);
 printf("      ");
 for (i = 0; i < 16; i++)
  printf(" %2d", i);

 printf("\nEXTICR");
 int mask = EXTI->IMR;
 for (i = 0; i < 4; i++)
 {
  val = SYSCFG->EXTICR[i];
  int j;
  for (j = 0; j < 4; j++)
  {
   printf("  %c", (mask & 1) ? 'a' + ((val >> (4 * j)) & 0xf) : ' ');
   mask >>= 1;
  }
 }
#endif

#if defined(STM32H743xx_H)
 extiBit("RTSR1", EXTI->RTSR1);
 extiBit("FTSR1", EXTI->FTSR1);
 extiBit("SWIER1", EXTI->SWIER1);
 extiBit("D3PMR1", EXTI->D3PMR1);
 extiBit("IMR1", EXTI->IMR1);
 extiBit("EMR1", EXTI->EMR1);
 extiBit("PR1", EXTI->PR1);
#endif

 printf("\n");
 flushBuf();
}

void usartInfo(USART_TypeDef *usart, const char *str)
{
 printf("usart %x %s\n",(unsigned int) usart, str);
#ifdef STM32F4
 printf("SR   %8lx ",usart->SR);
 printf("DR   %8lx\n",usart->DR);
#endif
#ifdef STM32F7
 printf("ISR  %8lx ",usart->ISR);
 printf("RDR  %8lx\n",usart->RDR);
#endif
 printf("BRR  %8lx ",usart->BRR);
 printf("CR1  %8lx\n",usart->CR1);
 printf("CR2  %8lx ",usart->CR2);
 printf("CR3  %8lx\n",usart->CR3);
 printf("GTPR %8lx\n",usart->GTPR);
 flushBuf();
}

#if 0
void i2cInfo(I2C_TypeDef *i2c, const char *str)
{
 printf("I2C %08x %s\n", (unsigned int) i2c, str);
 printf("CR1   %8lx ", i2c->CR1);
 printf("CR2   %8lx\n", i2c->CR2);
 printf("OAR1  %8lx ", i2c->OAR1);
 printf("OAR2  %8lx\n", i2c->OAR2);
 printf("SR1   %8lx ", i2c->SR1);
 printf("SR2   %8lx\n", i2c->SR2);
 printf("DR    %8lx ", i2c->DR);
 printf("CCR   %8lx\n", i2c->CCR);
 printf("TRISE %8lx\n", i2c->TRISE);
 flushBuf();
}
#endif

void i2cInfo(I2C_TypeDef *i2c, const char *str)
{
 printf("i2c %x %s\n",(unsigned int) i2c, str);
 printf("CR1      %8lx ",  i2c->CR1);
 printf("CR2      %8lx\n", i2c->CR2);
 printf("OAR1     %8lx ",  i2c->OAR1);
 printf("OAR2     %8lx\n", i2c->OAR2);
#if defined(STM32F1) || defined(STM32F3) || defined(STM32F4)
 printf("SR1      %8lx ",  i2c->SR1);
 printf("SR2      %8lx\n", i2c->SR2);
 printf("DR       %8lx ",  i2c->DR);
 printf("CCR      %8lx\n", i2c->CCR);
 printf("TRISE    %8lx\n", i2c->TRISE);
#endif
#ifdef STM32H7
 printf("TIMINGR  %8lx ",  i2c->TIMINGR);
 printf("TIMEOUTR %8lx\n", i2c->TIMEOUTR);
 printf("ISR      %8lx ",  i2c->ISR);
 printf("ICR      %8lx\n", i2c->ICR);
 printf("PECR     %8lx\n", i2c->PECR);
 printf("RXDR     %8lx ",  i2c->RXDR);
 printf("TXDR     %8lx\n", i2c->TXDR);
#endif
 flushBuf();
}

void spiInfo(SPI_TypeDef *spi, const char *str)
{
 printf("spi %x %s\n", (unsigned int) spi, str);
 printf("CR1      %8lx ",  spi->CR1);
 printf("CR2      %8lx\n", spi->CR2);
 printf("SR       %8lx\n", spi->SR);
}

void rccInfo()
{
#if defined(STM32F1)
 printf("RCC %08x\n", (unsigned int) RCC);
 printf("CR       %8lx ",  RCC->CR);
 printf("CFGR     %8lx\n", RCC->CFGR);
 printf("APB2RSTR %8lx ",  RCC->APB2RSTR);
 printf("APB1RSTR %8lx\n", RCC->APB1RSTR);
 printf("APB2ENR  %8lx ",  RCC->APB2ENR);
 printf("APB1ENR  %8lx\n", RCC->APB1ENR);
 printf("CIR      %8lx ",  RCC->CIR);
 printf("AHBENR   %8lx\n", RCC->AHBENR);
 printf("BDCR     %8lx ",  RCC->BDCR);
 printf("CSR      %8lx\n", RCC->CSR);
#endif
#ifdef STM32F4
 printf("CR         %8lx ",  RCC->CR);
 printf("PLLCFGR    %8lx\n", RCC->PLLCFGR);

 printf("CFGR       %8lx ",  RCC->CFGR);
 printf("CIR        %8lx\n", RCC->CIR);

 printf("AHB1RSTR   %8lx ",  RCC->AHB1RSTR);
 printf("AHB2RSTR   %8lx ",  RCC->AHB2RSTR);
 printf("AHB3RSTR   %8lx\n", RCC->AHB3RSTR);

 printf("APB1RSTR   %8lx ",  RCC->APB1RSTR);
 printf("APB2RSTR   %8lx\n", RCC->APB2RSTR);

 printf("AHB1ENR    %8lx ",  RCC->AHB1RSTR);
 printf("AHB2ENR    %8lx ",  RCC->AHB1RSTR);
 printf("AHB3ENR    %8lx\n", RCC->AHB1RSTR);

 printf("APB1ENR    %8lx ",  RCC->APB1ENR);
 printf("APB2ENR    %8lx\n", RCC->APB2ENR);

 printf("AHB1LPENR  %8lx ",  RCC->AHB1LPENR);
 printf("AHB2LPENR  %8lx ",  RCC->AHB2LPENR);
 printf("AHB3LPENR  %8lx\n", RCC->AHB3LPENR);

 printf("APB1LPENR  %8lx ",  RCC->APB1LPENR);
 printf("APB2LPENR  %8lx\n", RCC->APB2LPENR);

 printf("BDCR       %8lx ",  RCC->BDCR);
 printf("CSR        %8lx\n", RCC->CSR);

 printf("SSCGR      %8lx ",  RCC->BDCR);
 printf("PLLI2SCFGR %8lx\n", RCC->CSR);
#endif
#ifdef STM32H7
 printf("CR         %8lx ",  RCC->CR);
 printf("HSICFGR    %8lx\n", RCC->HSICFGR);

 printf("CRRCR      %8lx ",  RCC->CRRCR);
 printf("CSICFGR    %8lx ",  RCC->CSICFGR);
 printf("CFGR       %8lx\n", RCC->CFGR);

 printf("D1CFGR     %8lx ",  RCC->D1CFGR);
 printf("D2CFGR     %8lx ",  RCC->D2CFGR);
 printf("D3CFGR     %8lx\n", RCC->D3CFGR);

 printf("PLLCKSELR  %8lx ",  RCC->PLLCKSELR);
 printf("PLLCFGR    %8lx\n", RCC->PLLCFGR);

 printf("PLL1DIVR   %8lx ",  RCC->PLL1DIVR);
 printf("PLL1FRACR  %8lx\n", RCC->PLL1FRACR);

 printf("PLL2DIVR   %8lx ",  RCC->PLL2DIVR);
 printf("PLL2FRACR  %8lx\n", RCC->PLL2FRACR);

 printf("PLL3DIVR   %8lx ",  RCC->PLL3DIVR);
 printf("PLL3FRACR  %8lx\n", RCC->PLL3FRACR);

 printf("D1CCIPR    %8lx ",  RCC->D1CCIPR);
 printf("D2CCIP1R   %8lx ",  RCC->D2CCIP1R);
 printf("D2CCIP2R   %8lx ",  RCC->D2CCIP2R);
 printf("D3CCIPR    %8lx\n", RCC->D3CCIPR);

 printf("CIER       %8lx ",  RCC->CIER);
 printf("CIFR       %8lx\n", RCC->CIFR);

 printf("CICR       %8lx ",  RCC->CICR);
 printf("BDCR       %8lx ",  RCC->BDCR);
 printf("CSR        %8lx\n", RCC->CSR);

 printf("AHB3RSTR   %8lx ",  RCC->AHB3RSTR);
 printf("AHB1RSTR   %8lx ",  RCC->AHB1RSTR);
 printf("AHB2RSTR   %8lx\n", RCC->AHB2RSTR);
 printf("AHB4RSTR   %8lx ",  RCC->AHB4RSTR);
 printf("APB3RSTR   %8lx\n", RCC->APB3RSTR);

 printf("APB1LRSTR  %8lx ",  RCC->APB1LRSTR);
 printf("APB1HRSTR  %8lx ",  RCC->APB1HRSTR);
 printf("APB2RSTR   %8lx ",  RCC->APB2RSTR);
 printf("APB4RSTR   %8lx\n", RCC->APB4RSTR);

