e76nystrom/monitor/src/stm32Info.cpp
 printf("GCR        %8lx ",  RCC->GCR);
 printf("D3AMR      %8lx ",  RCC->D3AMR);
 printf("RSR        %8lx\n", RCC->RSR);

 printf("AHB3ENR    %8lx ",  RCC->AHB3ENR);
 printf("AHB1ENR    %8lx ",  RCC->AHB1ENR);
 printf("AHB2ENR    %8lx ",  RCC->AHB2ENR);
 printf("AHB4ENR    %8lx\n", RCC->AHB4ENR);

 printf("APB3ENR    %8lx ",  RCC->APB3ENR);
 printf("APB1LENR   %8lx ",  RCC->APB1LENR);
 printf("APB1HENR   %8lx\n", RCC->APB1HENR);
 printf("APB2ENR    %8lx ",  RCC->APB2ENR);
 printf("APB4ENR    %8lx\n", RCC->APB4ENR);

 printf("AHB3LPENR  %8lx ",  RCC->AHB3LPENR);
 printf("AHB1LPENR  %8lx ",  RCC->AHB1LPENR);
 printf("AHB2LPENR  %8lx ",  RCC->AHB2LPENR);
 printf("AHB4LPENR  %8lx ",  RCC->AHB4LPENR);

 printf("APB3LPENR  %8lx ",  RCC->APB3LPENR);
 printf("APB1LLPENR %8lx ",  RCC->APB1LLPENR);
 printf("APB1HLPENR %8lx\n", RCC->APB1HLPENR);
 printf("APB2LPENR  %8lx ",  RCC->APB2LPENR);
 printf("APB4LPENR  %8lx\n", RCC->APB4LPENR);
 #endif
}

#if 0
void rccInfo()
{
 printf("RCC %08x\n", (unsigned int) RCC);
 printf("CR       %8lx ",  RCC->CR);
 printf("CFGR     %8lx\n", RCC->CFGR);
 printf("APB2RSTR %8lx ",  RCC->APB2RSTR);
 printf("APB1RSTR %8lx\n", RCC->APB1RSTR);
 printf("APB2ENR  %8lx ",  RCC->APB2ENR);
 printf("APB1ENR  %8lx\n", RCC->APB1ENR);
 printf("CIR      %8lx ",  RCC->CIR);
 printf("AHBENR   %8lx\n", RCC->AHBENR);
 printf("BDCR     %8lx ",  RCC->BDCR);
 printf("CSR      %8lx\n", RCC->CSR);
}
#endif

void adcInfo(ADC_TypeDef *adc, char n)
{
 printf("ADC%d %08x  DR %08x\n",
	n, (unsigned int) adc, (unsigned int) &adc->DR);
#if defined(STM32F1)
 printf("SR    %8lx\n", adc->SR);
 printf("CR1   %8lx ", adc->CR1);
 printf("CR2   %8lx\n", adc->CR2);
 printf("HTR   %8lx ", adc->HTR);
 printf("LTR   %8lx\n", adc->LTR);
 printf("L     %8lx ", ((adc->SQR1 >> 20) & 0xf));
 printf("DR    %8lx\n", adc->DR);
 int i;
 printf("     ");
 for (i = 0; i < 16; i++)
  printf(" %2d", i);
 printf("\n");

 printf("SMPR ");
 int32_t tmp = adc->SMPR2;
 for (i = 0; i < 10; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 3;
 }
 tmp = adc->SMPR1;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 3;
 }
 printf("\n");

 printf("SQR  ");
 tmp = adc->SQR3;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 5;
 }
 tmp = adc->SQR2;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 5;
 }
 tmp = adc->SQR1;
 for (i = 0; i < 4; i++)
 {
  printf(" %2u", (unsigned int) (tmp & 7));
  tmp >>= 5;
 }
 printf("\n");
#endif	/* STM32F1 */
#if defined(STM32F3)
 printf("ISR   %8lx ", adc->ISR);
 printf("IER   %8lx\n", adc->IER);
 printf("CR    %8lx ", adc->CR);
 printf("CFGR  %8lx\n", adc->CFGR);
 printf("CAL   %8lx ", adc->CALFACT);
 printf("DR    %8lx\n", adc->DR);
 int i;
 printf("     ");
 for (i = 0; i < 16; i++)
  printf(" %2d", i);
 printf("\n");

 printf("SMPR ");
 int32_t tmp = adc->SMPR1;
 for (i = 0; i < 10; i++)
 {
  printf(" %2u", (unsigned char *) (tmp & 7));
  tmp >>= 3;
 }
 tmp = adc->SMPR2;
 for (i = 0; i < 9; i++)
 {
  printf(" %2u", (unsigned char *) (tmp & 7));
  tmp >>= 3;
 }
 printf("\n");

 printf("SQR  ");
 tmp = adc->SQR1;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned char *) (tmp & 0xf));
  tmp >>= 6;
 }
 tmp = adc->SQR2;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned char *) (tmp & 0x4));
  tmp >>= 6;
 }
 tmp = adc->SQR3;
 for (i = 0; i < 6; i++)
 {
  printf(" %2u", (unsigned char *) (tmp & 0xf));
  tmp >>= 6;
 }
 tmp = adc->SQR4;
 for (i = 0; i < 2; i++)
 {
  printf(" %2u", (unsigned char *) (tmp & 0xf));
  tmp >>= 6;
 }
 printf("\n");
#endif	/* STM32F3 */
 flushBuf();
}

#if defined(SMT32F1)
void dmaInfo(DMA_TypeDef *dma)
{
 printf("DMA1 %08x\n", (unsigned int) dma);
 printf("ISR   %8lx ", dma->ISR);
 printf("IFCR  %8lx\n", dma->IFCR);
 flushBuf();
}

void dmaChannelInfo(DMA_Channel_TypeDef *dmaC, char n)
{
 printf("DMA_Channel%d %08x\n", n, (unsigned int) dmaC);
 printf("CCR   %8lx ", dmaC->CCR);
 printf("CNDTR %8lx\n", dmaC->CNDTR);
 printf("CPAR  %8lx ", dmaC->CPAR);
 printf("CMAR  %8lx\n", dmaC->CMAR);
 flushBuf();
}
#endif

#if defined(STM32F4)
void dmaInfo(DMA_TypeDef *dma)
{
 printf("DMA   %08x\n", (unsigned int) dma);
 printf("LISR  %8lx ",  dma->LISR);
 printf("HISR  %8lx\n", dma->HISR);
 printf("LIFCR %8lx",   dma->LIFCR);
 printf("HIFCR %8lx\n", dma->HIFCR);
 flushBuf();
}

void dmaStreamInfo(DMA_StreamTypeDef *dmaS)
{
 printf("DMA_Stream %08x\n", (unsigned int) dmaS);
 printf("CR   %8lx ",   dmaS->CR);
 printf("NDTR %8lx\n",  dmaS->)NDTR;
 printf("PAR  %8lx ",   dmaS->PAR);
 printf("M0AR %8lx\n ", dmaS->M0AR);
 printf("M1AR %8lx ",   dmaS->M1AR);
 printf("FCR  %8lx\n ", dmaS->FCR);
}
#endif

void afioInfo()
{
#if defined(STM32F1)
 printf("AFIO %x\n", (unsigned int) AFIO);
 printf("EVCR      %8lx ",  AFIO->EVCR);
 printf("MAPR      %8lx\n", AFIO->MAPR);
 printf("EXTICR[0] %8lx ",  AFIO->EXTICR[0]);
 printf("EXTICR[1] %8lx\n", AFIO->EXTICR[1]);
 printf("EXTICR[2] %8lx ",  AFIO->EXTICR[2]);
 printf("EXTICR[3] %8lx\n", AFIO->EXTICR[3]);
 printf("MAPR2     %8lx\n", AFIO->MAPR2);
#endif
}

void bkpInfo()
{
#if defined(STM32F1)
 printf("BKP %x\n", (unsigned int) BKP);
 printf("RTCCR     %8lx ",  BKP->RTCCR);
 printf("CR        %8lx\n", BKP->CR);
 printf("CSR       %8lx\n", BKP->CSR);
#endif
}

void rtcInfo()
{
#if defined(STM32F1)
 printf("RTC %x\n", (unsigned int) RTC);
 printf("CRH       %8lx ",  RTC->CRH);
 printf("CRL       %8lx\n", RTC->CRL);
 printf("PRLH      %8lx ",  RTC->PRLH);
 printf("PRLL      %8lx\n", RTC->PRLL);
 printf("DIVH      %8lx ",  RTC->DIVH);
 printf("DIVL      %8lx\n", RTC->DIVL);
 printf("CNTH      %8lx ",  RTC->CNTH);
 printf("CNTL      %8lx\n", RTC->CNTL);
 printf("ALRH      %8lx ",  RTC->ALRH);
 printf("ALRL      %8lx\n", RTC->ALRL);
#endif
}

void pwrInfo()
{
 printf("PWR %x\n", (unsigned int) PWR);
#if defined(STM32F1) || defined(STM32F4)
 printf("CR        %8lx ",  PWR->CR);
 printf("CSR       %8lx\n", PWR->CSR);
#endif /* STM32F1 || STM32F4 */
#if defined(STM32H7)
 printf("CR1        %8lx ",  PWR->CR1);
 printf("CSR1       %8lx\n", PWR->CSR1);
 printf("CR2        %8lx ",  PWR->CR2);
 printf("CR3        %8lx\n", PWR->CR3);
 printf("CPUCR2     %8lx ",  PWR->CPUCR);
 printf("D3CR       %8lx\n", PWR->D3CR);
 printf("WKUPCR     %8lx ",  PWR->WKUPCR);
 printf("WKUPFR     %8lx\n", PWR->WKUPFR);
 printf("WKUPEPR    %8lx\n", PWR->WKUPEPR);
#endif /* STM32F7 */
}

#if defined(ARDUINO_ARCH_STM32)

extern unsigned char getNum();
extern int numVal;

char query(unsigned char (*get)(), const char *format, ...)
{
 va_list args;
 va_start(args, format);
 vprintf(format, args);
 va_end(args);
 flushBuf();
 char ch = get();
 newLine();
 return(ch);
}

#endif	/* ARDUINO_ARCH_STM32 */

void info()
{
#if defined(ARDUINO_ARCH_STM32)
 if (query(&getNum, " flag [0x%x]: ", lastFlags) == 0)
 {
  numVal = (int) lastFlags;
 }
 else
 {
  lastFlags = numVal;
 }
#else
 int numVal;
 if (query(&getNum, &numVal, " flag [0x%x]: ", lastFlags) == 0)
 {
  numVal = (int) lastFlags;
 }
 else
 {
  lastFlags = numVal;
 }
#endif
 newline();
 flushBuf();
 if (numVal & 0x01)
  tmrInfo(TIM1);
#ifdef TIM2
 if (numVal & 0x02)
  tmrInfo(TIM2);
#endif
#ifdef TIM3
 if (numVal & 0x04)
  tmrInfo(TIM3);
#endif
#ifdef TIM4
 if (numVal & 0x08)
  tmrInfo(TIM4);
#endif
#ifdef TIM5
 if (numVal & 0x10)
  tmrInfo(TIM5);
#endif

 if (numVal & 0x20)
 {
#ifdef TIM6
  tmrInfo(TIM6);
#endif
#ifdef TIM7
  tmrInfo(TIM7);
#endif
 }

#ifdef TIM8
 if (numVal & 0x40)
  tmrInfo(TIM8);
#endif

 if (numVal & 0x80)
 {
#ifdef TIM9
  tmrInfo(TIM9);
#endif
#ifdef TIM15
  tmrInfo(TIM15);
#endif
 }

 if (numVal & 0x100)
 {
#ifdef TIM10
  tmrInfo(TIM10);
#endif
#ifdef TIM16
  tmrInfo(TIM16);
#endif
 }

 if (numVal & 0x200)
 {
#ifdef TIM11
  tmrInfo(TIM11);
#endif
#ifdef TIM17
  tmrInfo(TIM17);
#endif
 }

#ifdef TIM12
 if (numVal & 0x400)
  tmrInfo(TIM12);
#endif

 if (numVal & 0x800)		/* exti */
  extiInfo();

 if (numVal & 0x01000)
  gpioInfo(GPIOA);
 if (numVal & 0x02000)
  gpioInfo(GPIOB);
 if (numVal & 0x04000)
  gpioInfo(GPIOC);
#ifdef GPIOD
 if (numVal & 0x08000)
  gpioInfo(GPIOD);
#endif
#ifdef GPIOE
 if (numVal & 0x10000)
  gpioInfo(GPIOE);
#endif
#ifdef GPIOF
 if (numVal & 0x20000)
  gpioInfo(GPIOF);
#endif
#ifdef GPIOG
 if (numVal & 0x40000)
  gpioInfo(GPIOH);
#endif

#if defined(STM32MON)
 if (numVal & 0x100000)
  usartInfo(USART1, "DBG");
 if (numVal & 0x200000)
  usartInfo(USART3, "WIFI");
#else
 if (numVal & 0x100000)
 {
  usartInfo(DBGPORT, "DBG");
  usartInfo(REMPORT, "REM");
#if defined(MEGAPORT)
  usartInfo(DBGPORT, "MEGA");
#endif	/* MEGAPORT */
 }
#endif	/* STM32MON */

 if (numVal & 0x400000)
 {
#if defined(STM32MON)
  i2cInfo(I2C1, "I2C1");
#else
#ifdef I2C1
  i2cInfo(I2C_DEV, I2C_NAME);
#endif
#if defined(SPI3)
  spiInfo(SPIn, SPI_NAME);
#endif  /* SPI3 */
#endif  // STM32MON
 }

 if (numVal & 0x800000)
 {
  adcInfo(ADC1, '1');
  newline();
  adcInfo(ADC2, '2');
 }
 if (numVal & 0x1000000)
 {
  rtcInfo();
 }
 if (numVal & 0x2000000)
 {
  pwrInfo();
  newline();
  bkpInfo();
  newline();
  afioInfo();
 }
}

//void bitState(const char *s, volatile const uint32_t *p, uint32_t mask)
//{
// printf("%s %c\n", s, ((*p & mask) == 0) ? '0' : '1');
//}

#endif	/* __STM32INFO */
